#ifndef __SNAKE_GAME__
#define __SNAKE_GAME__
#include <vector>
#include "Board.h"
#include "ScoreBoard.h"
#include "Mission.h"
#include "Rank.h"
using namespace std;

enum DIRECTION {
    UP, DOWN, RIGHT, LEFT
};

enum GATETYPE {OUTER, INNER};

class Snake;

class SnakeGame{
public:
    SnakeGame(int height, int width);
    ~SnakeGame();

    void processInput();
    void updateState();
    void redraw();
    bool checkWB(int y, int x);
    void checkLength();
    bool checkGate(int y, int x);
    int gateHeadY(int referY, int referX);
    int gateHeadX(int referY, int referX);
    void goDirection();
    void readBoard();
    void makeGItem();
    void makePItem();
    void snakeOnBoard(Snake *s);
    bool isOver();
    void gameOver();
    void setDirection(DIRECTION d);
    void setTimeScore();
    void setInnerWall();
    bool makeGateCheck(int num);
    void makeGate();

private:
    Score *score;
    Mission *mission;
    Board board;
    ScoreBoard score_board;
    MissionBoard mission_board;
    RankBoard rank_board;
    bool game_over;
    DIRECTION direction;
    Snake *snake;
    int gItemNum;
    int pItemNum;
    //여기도 추가했음
    vector<int> wallYPosition;
    vector<int> wallXPosition;
    int gate1Y;
    int gate1X;
    int gate2Y;
    int gate2X;
    // gameboard의 가장자리 2로 수정 
    char gameBoard[21][21] = {
                {'2', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '2'},
                {'1', '0', '0', 'g', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1'},
                {'2', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '2'}
            };
};


#endif